# FlowDirection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData..::..FlowDirection Property
DuctFittingAndAccessoryConnectorData Class See Also
---
the flow direction of this connector, In or Out.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FlowDirectionType FlowDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FlowDirection As FlowDirectionType
	Get
```

Visual C++
---
```text
public:
property FlowDirectionType FlowDirection {
	FlowDirectionType get ();
}
```

# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace